Revit 2024 API
ParameterTypeId.RebarSystemHookOrientFrontDirn1 Property
 "Exterior Major Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarSystemHookOrientFrontDirn1 { get; }
Visual Basic
Public Shared ReadOnly Property RebarSystemHookOrientFrontDirn1 As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarSystemHookOrientFrontDirn1 {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace